Revit 2024 API
InitialIlluminanceIntensity Members
The InitialIlluminanceIntensity type exposes the following members.
Constructors
Name | Description
InitialIlluminanceIntensity(InitialIlluminanceIntensity)
 Creates a copy of the given initial illuminance intensity object
InitialIlluminanceIntensity(Double, Double)
 Creates an initial illuminance intensity object with the given document and illuminance values.
Methods
Name | Description
Clone
 Creates a copy of the InitialIntensity derived object.
 (Inherited from InitialIntensity.)
Dispose |  (Inherited from InitialIntensity.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Distance
 The illuminance intensity distance value.
Illuminance
 The illuminance intensity value.
InitialIntensityValue
 The calculated initial intensity value.
 (Inherited from InitialIntensity.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from InitialIntensity.)
See Also
InitialIlluminanceIntensity Class
Autodesk.Revit.DB.Lighting Namespace